_posts/2016-12-19-read-mail-on-emacs-with-mu4e.html
<div class="HTML">
<p>
&#x2014;<br />
layout: default<br />
title: Read Mail on Emacs with mu4e<br />
&#x2014;<br />
</p>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a72c2c">1. Rmail</a></li>
<li><a href="#org847464f">2. mu4e</a>
<ul>
<li><a href="#orgd8285f6">2.1. 下载邮件</a></li>
<li><a href="#org0e3d134">2.2. 查看邮件</a></li>
<li><a href="#orgb2eb34b">2.3. Key Bindings</a></li>
</ul>
</li>
<li><a href="#org34c5331">3. enjoying!</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3a72c2c" class="outline-2">
<h2 id="org3a72c2c"><span class="section-number-2">1</span> Rmail</h2>
<div class="outline-text-2" id="text-1">
<p>
emacs自带的Rmail是可以阅读邮件的，配合movemail程序，用很简单的配置就可以实现：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #555f61;">;; </span><span style="color: #555f61;">emacs&#20869;&#32622;&#30340;movemail&#19981;&#25903;&#25345;imap&#65292;&#21487;&#20197;&#23433;&#35013;gnu mailutils&#25552;&#20379;&#30340;movemail&#20197;&#25903;&#25345;imap</span>
<span style="color: #1395ba;">(</span><span style="color: #1395ba; font-weight: bold;">setq</span> rmail-movemail-program <span style="color: #a2b86c;">"/usr/bin/movemail"</span><span style="color: #1395ba;">)</span>

<span style="color: #555f61;">;; </span><span style="color: #555f61;">&#35774;&#32622;imap&#26381;&#21153;</span>
<span style="color: #1395ba;">(</span><span style="color: #1395ba; font-weight: bold;">setq</span> rmail-primary-inbox-list <span style="color: #1395ba; font-weight: bold;">'</span><span style="color: #ecaa38;">(</span><span style="color: #a2b86c;">"imap://me@somemail.com"</span><span style="color: #ecaa38;">)</span>
      rmail-remote-password-required t
      rmail-remote-password <span style="color: #a2b86c;">"xxxxxxxx"</span>
      <span style="color: #1395ba;">)</span>
</pre>
</div>
<p>
使用rmail命令就可以看到邮件了，rmail会调用movemail下载邮件，并展示一封邮件。但是Rmail的展示以及操作不太友好，于是就有了mu4e(mu for emacs).<br />
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Rmail.html#Rmail">Referrence of Rmail</a><br />
</p>
</div>
</div>
<div id="outline-container-org847464f" class="outline-2">
<h2 id="org847464f"><span class="section-number-2">2</span> mu4e</h2>
<div class="outline-text-2" id="text-2">
<p>
"mu4e is an emacs-based e-mail client. It’s based on the mu e-mail indexer/searcher. It attempts to be a super-efficient tool to withstand the daily e-mail tsunami."<br />
-&#x2014; <a href="https://www.emacswiki.org/emacs/mu4e">emacswiki</a><br />
</p>
</div>
<div id="outline-container-orgd8285f6" class="outline-3">
<h3 id="orgd8285f6"><span class="section-number-3">2.1</span> 下载邮件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
我选择使用offlineimap下载邮件，vim时期配置过mutt，当时就用的offlineimap，觉得蛮好用的。<br />
offlineimap的配置网上也是很多，比如我自己的配置(~/.offlineimaprc)：<br />
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #1395ba;">[</span>general<span style="color: #1395ba;">]</span>
<span style="color: #5ca793;">accounts</span> = mymail
<span style="color: #5ca793;">maxsyncaccounts</span> = 3

<span style="color: #1395ba;">[</span>Account mymail<span style="color: #1395ba;">]</span>
<span style="color: #5ca793;">localrepository</span> = mymail-local
<span style="color: #5ca793;">remoterepository</span> = mymail-remote
<span style="color: #5ca793;">status_backend</span> = sqlite

<span style="color: #1395ba;">[</span>Repository mymail-local<span style="color: #1395ba;">]</span>
<span style="color: #5ca793;">type</span> = Maildir
<span style="color: #5ca793;">localfolders</span> = ~/.mailbox

<span style="color: #1395ba;">[</span>Repository mymail-remote<span style="color: #1395ba;">]</span>
<span style="color: #5ca793;">type</span> = Gmail
<span style="color: #5ca793;">folderfilter</span> = lambda folder: folder<span style="color: #1395ba; font-weight: bold;"> in</span> <span style="color: #1395ba;">[</span><span style="color: #a2b86c;">'[Gmail]/Archive'</span>, <span style="color: #a2b86c;">'[Gmail]/All Mail'</span>, <span style="color: #a2b86c;">'[Gmail]/Drafts'</span>, <span style="color: #a2b86c;">'[Gmail]/Sent Mail'</span>, <span style="color: #a2b86c;">'[Gmail]/Starred'</span><span style="color: #1395ba;">]</span>
<span style="color: #5ca793;">nametrans</span> = lambda foldername: re.sub <span style="color: #1395ba;">(</span><span style="color: #a2b86c;">'^\[gmail\].'</span>, <span style="color: #a2b86c;">''</span>,
                               re.sub <span style="color: #ecaa38;">(</span><span style="color: #a2b86c;">'all_mail'</span>, <span style="color: #a2b86c;">'all'</span>,
                               re.sub <span style="color: #a2b86c;">(</span><span style="color: #a2b86c;">'sent_mail'</span>, <span style="color: #a2b86c;">'sent'</span>,
                               re.sub <span style="color: #40805b;">(</span><span style="color: #a2b86c;">'starred'</span>, <span style="color: #a2b86c;">'flagged'</span>,
                               re.sub <span style="color: #b1951d;">(</span><span style="color: #a2b86c;">' '</span>, <span style="color: #a2b86c;">'_'</span>, foldername.lower<span style="color: #1395ba;">()</span><span style="color: #b1951d;">)</span><span style="color: #40805b;">)</span><span style="color: #a2b86c;">)</span><span style="color: #ecaa38;">)</span><span style="color: #1395ba;">)</span>
<span style="color: #5ca793;">remoteuser</span> = jiazhang@gmail.com
<span style="color: #5ca793;">remotepass</span> = &lt;gmail app password&gt;
<span style="color: #5ca793;">ssl</span> = yes
<span style="color: #5ca793;">maxconnections</span> = 1
<span style="color: #5ca793;">realdelete</span> = no
<span style="color: #5ca793;">sslcacertfile</span> = /etc/ssl/certs/ca-certificates.crt
</pre>
</div>
<p>
配置好，在终端跑一下offlineimap，看看是否可以下载邮件了。offlineimap配置OK了，就可开始配置mu4e。<br />
</p>
</div>
</div>
<div id="outline-container-org0e3d134" class="outline-3">
<h3 id="org0e3d134"><span class="section-number-3">2.2</span> 查看邮件</h3>
<div class="outline-text-3" id="text-2-2">
<p>
首先是安装mu，mu中提供mu4e，<a href="https://github.com/djcb/mu">Github</a>。<br />
可参考配置:<br />
</p>
<div class="org-src-container">
<pre class="src src-emcas-lisp">(add-to-list 'load-path "/usr/local/share/emacs/site-list/mu4e")
(require 'mu4e)

;; 这部分配置要跟offlineimap一致，否则看不到任何邮件啊
(setq
 mu4e-maildir "~/.mailbox"
 mu4e-sent-folder "/sent"
 mu4e-drafts-folder "/drafts"
 mu4e-trash-folder "/trash"
 mu4e-refile-folder "/archive"
 mu4e-attachment-dir  "~/Downloads"
 mu4e-html2text-command "html2text -utf8 -width 72")

;; 这是跳转文件夹的快捷键设置
(setq mu4e-maildir-shortcuts
      '( ("/drafts"      . ?d)
         ("/sent"        . ?s)
         ("/trash"       . ?t)
         ("/flagged"     . ?f)
         ("/all"         . ?a)))

;; 这是HV的展示设置
(setq mu4e-headers-fields
      '((:date          .  25)    ;m; alternatively, use :human-date
        (:flags         .   6)
        (:from          .  22)
        (:subject       .  nil))) ;; alternatively, use :thread-subject

(setq mu4e-get-mail-command "offlineimap"
      mu4e-update-interval 300
      message-send-mail-function 'smtpmail-send-it)
</pre>
</div>
<p>
emacs里执行mu4e就可以通过打开不通的文件查看邮件了。<br />
由于墙的原因，用的免费vpn发不了邮件，所以"smtpmail-smtp-server"和"smtpmail-smtp-service"没有setq，一个是服务，另一个是端口。<br />
</p>
</div>
</div>
<div id="outline-container-orgb2eb34b" class="outline-3">
<h3 id="orgb2eb34b"><span class="section-number-3">2.3</span> Key Bindings</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orga059cb8" class="outline-4">
<h4 id="orga059cb8"><span class="section-number-4">2.3.1</span> Global</h4>
<div class="outline-text-4" id="text-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-c C-u / C-S-u</td>
<td class="org-left">Update email &amp; database</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">switch between header view and message view</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">searching, <a href="http://www.djcbsoftware.nl/code/mu/mu4e/Queries.html#Queries">quering email</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge9e6aeb" class="outline-4">
<h4 id="orge9e6aeb"><span class="section-number-4">2.3.2</span> Header View</h4>
<div class="outline-text-4" id="text-2-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">n / p</td>
<td class="org-left">go to next/previous header, and update message view if it's open</td>
</tr>

<tr>
<td class="org-left">] / [</td>
<td class="org-left">go to next/previous unread header, and update message view if it's open</td>
</tr>

<tr>
<td class="org-left">C-n / C-p</td>
<td class="org-left">go to next/previous header</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">toggle threading</td>
</tr>
</tbody>
</table>
<p>
<a href="http://www.djcbsoftware.nl/code/mu/mu4e/Keybindings.html#Keybindings">more</a><br />
</p>
</div>
</div>
<div id="outline-container-orgf486050" class="outline-4">
<h4 id="orgf486050"><span class="section-number-4">2.3.3</span> Message View</h4>
<div class="outline-text-4" id="text-2-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">g</td>
<td class="org-left">go to numbered url</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">save the numbered url in the kill-ring</td>
</tr>

<tr>
<td class="org-left">o</td>
<td class="org-left">open numbered attachment</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">save numbered attachment</td>
</tr>
</tbody>
</table>
<p>
<a href="http://www.djcbsoftware.nl/code/mu/mu4e/MSGV-Keybindings.html#MSGV-Keybindings">more</a><br />
</p>
</div>
</div>
<div id="outline-container-org2e2cbf1" class="outline-4">
<h4 id="org2e2cbf1"><span class="section-number-4">2.3.4</span> Mark for actions</h4>
<div class="outline-text-4" id="text-2-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">? / !</td>
<td class="org-left">mark message as unread/read</td>
</tr>

<tr>
<td class="org-left">d / D</td>
<td class="org-left">mark trash/delete</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">mark based on a regular expression</td>
</tr>

<tr>
<td class="org-left">T / t</td>
<td class="org-left">mark whole thread/subthread</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">execute actions for the marked messages</td>
</tr>
</tbody>
</table>
<p>
<a href="http://www.djcbsoftware.nl/code/mu/mu4e/Keybindings.html#Keybindings">more</a><br />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org34c5331" class="outline-2">
<h2 id="org34c5331"><span class="section-number-2">3</span> enjoying!</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://www.djcbsoftware.nl/code/mu/mu4e/index.html#SEC_Contents">mu4e manual</a><br />
</p>
</div>
</div>
